class PsychologicalTrait {
  static namesInUkrainian = {
    Tryvozhnist: "Тривожність",
    Tsyklotymnist: "Циклотимність",
    Demonstratyvnist: "Демонстративність",
    Dystymiya: "Дистимія",
    Emotyvnist: "Емотивність",
    Ekzaltovanist: "Екзальтованість",
    Zbudlyvist: "Збудливість",
    Hipertymnist: "Гіпертимність",
    Introversiya: "Інтроверсія",
    Zastryvannya: "Застрявання",
    Pedantychnist: "Педантичність",
  };

  constructor(coefficient, reactions) {
      this.coefficient = coefficient;
      this.count = 0;
      this.reactions = reactions;
  }

  check(number, char) {
      if (this.reactions[number] === char) {
          this.count++;
      }
  }

  getResult() {
      const traitName = this.constructor.name; 
      const ukrainianName = PsychologicalTrait.namesInUkrainian[traitName]; 
      return `${ukrainianName}: ${this.count * this.coefficient}`; 
  }
}

class Tryvozhnist extends PsychologicalTrait {
  static reactions = {
      4: '-',
      15: '+',
      26: '+',
      36: '+',
      48: '+',
      59: '+',
      70: '+',
      80: '+',
      81: '+'
  };

  constructor() {
      super(3, Tryvozhnist.reactions);
  }
}



class Tsyklotymnist extends PsychologicalTrait {
  static reactions = {
      5: '+',
      17: '+',
      27: '+',
      49: '+',
      61: '+',
      63: '+',
      71: '+',
      83: '+'
  };

  constructor() {
      super(3, Tsyklotymnist.reactions);
  }
}

class Demonstratyvnist extends PsychologicalTrait {
  static reactions = {
      6: '+',
      18: '+',
      21: '+',
      38: '+',
      39: '+',
      43: '+',
      50: '-',
      62: '+',
      65: '+',
      72: '+',
      84: '+',
      87: '+'
  };

  constructor() {
      super(2, Demonstratyvnist.reactions);
  }
}

class Dystymiya extends PsychologicalTrait {
  static reactions = {
      8: '+',
      20: '+',
      30: '-',
      42: '+',
      52: '-',
      64: '-',
      74: '+',
      86: '+'
  };

  constructor() {
      super(3, Dystymiya.reactions);
  }
}



class Emotyvnist extends PsychologicalTrait {
  static reactions = {
      2: '+',
      12: '+',
      24: '-',
      33: '+',
      46: '+',
      56: '+',
      68: '+',
      78: '+'
  };

  constructor() {
      super(3, Emotyvnist.reactions);
  }
}

class Ekzaltovanist extends PsychologicalTrait {
  static reactions = {
      9: '+',
      31: '+',
      53: '+',
      75: '+'
  };

  constructor() {
      super(6, Ekzaltovanist.reactions);
  }
}

class Zbudlyvist extends PsychologicalTrait {
  static reactions = {
      7: '+',
      19: '+',
      29: '+',
      40: '+',
      41: '+',
      51: '+',
      73: '+',
      85: '+'
  };

  constructor() {
      super(3, Zbudlyvist.reactions);
  }
}

class Hipertymnist extends PsychologicalTrait {
  static reactions = {
      0: '+',
      10: '+',
      22: '+',
      32: '+',
      44: '+',
      54: '+',
      66: '+',
      76: '+'
  };

  constructor() {
      super(3, Hipertymnist.reactions);
  }
}

class Introversiya extends PsychologicalTrait {
  static reactions = {
      2: '-',
      6: '-',
      9: '-',
      32: '-',
      49: '-',
      60: '+',
      88: '+',
      89: '-'
  };

  constructor() {
      super(3, Introversiya.reactions);
  }
}

class Zastryvannya extends PsychologicalTrait {
  static reactions = {
      1: '+',
      11: '-',
      14: '+',
      23: '+',
      28: '+',
      34: '+',
      35: '+',
      45: '-',
      55: '+',
      58: '-',
      67: '+',
      77: '+'
  };

  constructor() {
      super(2, Zastryvannya.reactions);
  }
}

class Pedantychnist extends PsychologicalTrait {
  static reactions = {
      3: '+',
      13: '+',
      16: '+',
      25: '+',
      34: '-',
      37: '+',
      47: '+',
      57: '+',
      60: '+',
      69: '+',
      79: '+',
      82: '+'
  };

  constructor() {
      super(2, Pedantychnist.reactions);
  }
}


class Test {
  static questions = [
"1. Ви переважно буваєте в доброму гуморі?",
"2. Ви вразливі до образ та прикрощів?",
"3. Вам легко заплакати?",
"4. У Вас виникають сумніви щодо якості виконання роботи після її завершення, чи намагаєтесь Ви її перевірити?",
"5. У дитинстві Ви були такі ж сміливі, як і Ваші однолітки?",
"6. Чи бувають у Вас зміни настрою від дуже веселого до дуже сумного?",
"7. Зазвичай Ви перебуваєте в центрі уваги товариства, компанії?",
"8. Ви буваєте в невдоволено-буркотливому настрої без будь-якого приводу?",
"9. Ви серйозна людина?",
"10. Чи здатні Ви захоплюватися чимсь чи бути в захваті від чогось?",
"11. Ви діловита людина?",
"12. Ви швидко забуваєте образи?",
"13. Ви м’якосердна людина?",
"14. Кинувши лист до поштової скриньки, Ви перевіряєте рукою чи не застряг він у щілині?",
"15. Ви прагнете до того, щоб завжди на роботі бути одним із кращих працівників?",
"16. Ви боялися в дитинстві грози, незнайомих собак?",
"17. Ви прагнете завжди й у всьому дотримуватися порядку?",
"18. Ваш настрій залежить від зовнішніх обставин?",
"19. Вас люблять Ваші знайомі?",
"20. Часто у Вас буває відчуття внутрішнього занепокоєння, лиха, можливих неприємностей?",
"21. У Вас часто буває дещо пригнічений настрій?",
"22. Чи траплялись у Вас випадки, коли Ви ридали, переживали тяжкі нервові потрясіння?",
"23. Вам важко довго всидіти на місці?",
"24. Чи енергійно Ви відстоюєте власні інтереси, якщо щодо Вас несправедливо вчинили?",
"25. Ви спроможні зарізати живого птаха?",
"26. Вас дратує, коли скатертина або фіранка висять нерівно; чи намагаєтеся Ви негайно це виправити?",
"27. Ви боялися в дитинстві залишатися вдома наодинці?",
"28. У Вас бувають зміни настрою без очевидних причин?",
"29. За своїми професійними якостями Ви один із кращих фахівців?",
"30. Ви швидко починаєте гніватися?",
"31. Ви здатні бути безтурботно веселим?",
"32. Чи буває у Вас такий стан, коли Ви сповнені щастям?",
"33. Ви здатні розважати товариство, бути душею компанії?",
"34. Коли Ви бачите кров, це викликає у Вас неприємні відчуття?",
"35. Ви охоче беретеся за справу, яка вимагає від Вас високого рівня власної відповідальності?",
"36. Будете Ви заступатися за людей, з якими обійшлися несправедливо?",
"37. Чи викликає у Вас хвилювання необхідність увійти до темного підвалу, неосвітленої кімнати?",
"38. Ви віддаєте перевагу діяльності, що вимагає повільності та ретельності?",
"39. Ви із задоволенням спілкуєтеся з оточуючими?",
"40. Ви охоче декламували в школі вірші?",
"41. У дитинстві Ви тікали з дому?",
"42. Ви здатні прямо висловити комусь Вашу думку щодо нього?",
"43. Чи видається Вам життя важким?",
"44. Чи траплялись у Вас випадки, що, засмутившись через певний конфлікт, Ви були не в змозі йти на роботу, до школи?",
"45. Ви можете стверджувати, що навіть у випадках невдачі Ви не втрачаєте почуття гумору?",
"46. Чи намагаєтеся Ви помиритися, якщо кого-небудь скривдили? Ви першим ідете на примирення?",
"47. Ви любите тварин?",
"48. Траплялося Вам повертатися додому, щоб перевірити, чи щось не трапилось?",
"49. Вас хвилювали коли-небудь думки, що з Вами чи з Вашими рідними має щось статися?",
"50. Ви вважаєте, що у Вас мінливий настрій?",
"51. Вам складно виступати на сцені або з кафедри перед великою аудиторією?",
"52. Ви можете вдарити кривдника, якщо він Вас образить?",
"53. Чи велика у Вас потреба в спілкуванні з іншими людьми?",
"54. Розчарувавшись, Ви можете впасти у відчай?",
"55. Вам до вподоби організаторська діяльність?",
"56. Чи будете Ви наполегливими в досягненні мети, якщо на шляху до цього будуть великі перешкоди?",
"57. Вас може схвилювати трагічний фільм так, що на очах з’являться сльози?",
"58. Чи буває так, що Вам важко заснути через думки про денні проблеми та майбутні турботи?",
"59. Навчаючись у школі, Ви підказували однокласникам, давали їм списувати?",
"60. Ви б хвилювалися, якби виникла необхідність пройти одному в темряві через цвинтар?",
"61. Ви стежите за тим, щоб кожна річ була на своєму місці?",
"62. Вам траплялося засинати в гарному настрої, а прокидатись – у пригніченому?",
"63. Вам легко пристосовуватися до нових умов?",
"64. У Вас часто болить голова?",
"65. Ви часто смієтеся?",
"66. Ви можете ставитися до людей, яких не поважаєте, так, щоб вони цього не помітили?",
"67. Ви вважаєте себе активною, енергійною людиною?",
"68. Вас дуже хвилює несправедливість?",
"69. Ви любите природу?",
"70. Ви перевіряєте, чи закритий газ, вимкнене світло та замкнені двері, коли лягаєте спати або йдете з дому?",
"71. Ви боязка людина?",
"72. Прийом алкоголю впливає на зміну Вашого настрою?",
"73. Ви були (чи є й зараз) учасником аматорських вистав, драматичних гуртків?",
"74. У Вас часто виникає бажання подорожувати?",
"75. До майбутнього Ви ставитеся песимістично?",
"76. Чи спостерігається у Вас мінливість настрою від великої радості до раптової туги?",
"77. У спілкуванні з людьми Ви здатні створювати певний настрій?",
"78. Ви довго відчуваєте образу, прикрість?",
"79. Ви довгий час переживаєте проблеми інших людей?",
"80. Навчаючись у школі, Ви могли б переписати сторінку через помарку?",
"81. Ви ставитеся до людей більше з недовірою й обережністю, аніж з довірою?",
"82. У Вас часто бувають страшні сни?",
"83. Чи буває так, що Вам здається, що Ви можете кинутися під потяг або, стоячи біля вікна, вистрибнути із нього з висоти?",
"84. У веселій компанії Ви зазвичай веселі?",
"85. Ви здатні відволіктися від складних проблем, що вимагають вирішення?",
"86. Під впливом алкоголю Ви вчиняєте імпульсивні дії?",
"87. У бесіді Ви більше небагатослівні, ніж балакучі?",
"88. За необхідності грати на сцені Ви б змогли вжитися в роль так, щоб забути, що це тільки гра?",
"89. Ви віддаєте перевагу роботі на самоті?",
"90. Вам подобаються першоквітневі жарти?"
];

constructor() {
  this.currentQuestionIndex = 0;

    this.traits = [new Hipertymnist(), new Zastryvannya(), new Emotyvnist(), 
      new Pedantychnist(), new Tryvozhnist(), new Tsyklotymnist(), new Demonstratyvnist(),
      new Zbudlyvist(), new Dystymiya(), new Ekzaltovanist(),  new Introversiya()
    ];
}

loadNextQuestion() {
  if (this.currentQuestionIndex < Test.questions.length) {
      document.getElementById('question').value = Test.questions[this.currentQuestionIndex];
  } else {
      this.showResults();
  }
}

recordAnswer(answer) {
  console.log(Test.questions[this.currentQuestionIndex], answer);
  this.traits.forEach(trait => trait.check(this.currentQuestionIndex, answer));
  this.currentQuestionIndex++;
  this.loadNextQuestion();
}

showResults() {
  console.log(this.traits.map(trait => trait.getResult()));
  const results = this.traits.map(trait => trait.getResult()).join('\n');
  alert(results);
}
}

const test = new Test();


window.onload = function () {
  test.loadNextQuestion();
};

document.getElementById('yesButton').addEventListener('click', function() {
  test.recordAnswer('+');
});

document.getElementById('noButton').addEventListener('click', function() {
  test.recordAnswer('-');
});

document.getElementById('backButton').addEventListener('click', function() {
  if (test.currentQuestionIndex > 0) {
    
      test.currentQuestionIndex--;
      test.loadNextQuestion();
  }
});




